W1D5/URLShortener/app/models/shortened_url.rb

  def self.user_and_shorturl(user, long_url)
    ShortenedUrl.create!(
      submitter_id: user.id,
      long_url: long_url,
      short_url: ShortenedUrl.random_code
    )
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "5FNBMecPLq_x00TaTnw5xQ"], ["submitter_id", 1], ["created_at", "2021-12-03 18:39:51.389050"], ["updated_at", "2021-12-03 18:39:51.389050"]]

  def no_spamming
    last_min = ShortenedUrl
      .where('created_at > ?', 1.minute.ago)
      .where(submitter_id: submitter_id)
      .length
---
SELECT "shortened_urls".* FROM "shortened_urls" WHERE (created_at > '2021-12-03 18:38:51.384744') AND "shortened_urls"."submitter_id" = $1  [["submitter_id", 1]]

  def nonpremium_max
    return if User.find(self.submitter_id).premium
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."submitter_id" = $1  [["submitter_id", 2]]