W1D5/polls_app/app/models/response.rb

SELECT "responses".* FROM "responses" ORDER BY "responses"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def sibling_responses
        self.question.responses.where.not(id: self.id)

SELECT "polls"."author_id" FROM "polls" INNER JOIN "questions" ON "questions"."poll_id" = "polls"."id" INNER JOIN "answer_choices" ON "answer_choices"."question_id" = "questions"."id" WHERE (answer_choices.id = 1)
---
    def respondent_is_not_poll_author
      poll_author_id = Poll
        .joins(questions: :answer_choices)
        .where('answer_choices.id = ?', self.answer_choice_id)
        .pluck('polls.author_id')
        .first